# MEPNetworkSegmentData Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
MEPNetworkSegmentData Methods
MEPNetworkSegmentData Class See Also
---
The MEPNetworkSegmentData type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetDownstreamSegments | Gets all downstream network segments. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| GetUpstreamSegments | Gets all upstream network segments. |
| IsValid | Verified if this segment data has been assigned some valid values afer calculation. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
MEPNetworkSegmentData Class
Autodesk.Revit.DB.Analysis Namespace